/** @file
  SEG string definition
//;******************************************************************************
//;* Copyright (c) 1983-2016, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
*/
//[-start-160429-IB07400722-add]//
#string STR_HIDE_UNUSED_DEVICES_PROMPT                  #language en-US  "Hide Unused LPSS devices"
#string STR_HIDE_UNUSED_DEVICES_HELP                    #language en-US  "Enable/Disable hide Unused LPSS ACPI devices"
//[-end-160429-IB07400722-add]//
//[-start-160624-IB07400748-add]//
#string STR_RT_IDI_AGENT_PROMPT                         #language en-US "Real Time Option"
#string STR_RT_IDI_AGENT_HELP                           #language en-US "Select the IDI Agent Real-Time Traffic Mask Bits"
#string STR_RT_IDI_AGENT_DISABLE                        #language en-US "Disabled"
#string STR_RT_IDI_AGENT_DID1                           #language en-US "IDI1"
//Power Limit
#string STR_LONG_DUR_PWR_LIMIT_SUPPORT_PROMPT           #language en-US  "Power Limit 1 Enable"
#string STR_LONG_DUR_PWR_LIMIT_SUPPORT_HELP             #language en-US  "Enable/Disable Power Limit 1"
#string STR_LONG_DUR_PWR_LIMIT_CLAMP_PROMPT             #language en-US  "Power Limit 1 Clamp Mode"
#string STR_LONG_DUR_PWR_LIMIT_CLAMP_HELP               #language en-US  "Enable/Disable Power Limit 1 Clamp Mode"
#string STR_LONG_DUR_PWR_LIMIT_TIME_PROMPT              #language en-US  "Power Limit 1 Time Window"
#string STR_LONG_DUR_PWR_LIMIT_TIME_HELP                #language en-US  "Power Limit 1 Time Window Value in Seconds. Auto will program Power Limit 1 Time Window based on silicon default support value"
#string STR_LONG_DUR_PWR_LIMIT_PROMPT                   #language en-US  "Power Limit 1 Power"
#string STR_LONG_DUR_PWR_LIMIT_HELP                     #language en-US  "Power Limit 1 in Watts. Auto will program Power Limit 1 based on silicon default support value"
#string STR_LONG_DUR_PWR_LIMIT_STRING                   #language en-US  "Power Limit 1"
#string STR_LONG_DUR_PWR_LIMIT_VALUE                    #language en-US  ""
#string STR_SHORT_DUR_PWR_LIMIT_STRING                  #language en-US  "Power Limit 2"
#string STR_SHORT_DUR_PWR_LIMIT_VALUE                   #language en-US  ""
#string STR_1                                           #language en-US  "1"
#string STR_2                                           #language en-US  "2"
#string STR_3                                           #language en-US  "3"
#string STR_4                                           #language en-US  "4"
#string STR_5                                           #language en-US  "5"
#string STR_6                                           #language en-US  "6"
#string STR_7                                           #language en-US  "7"
#string STR_8                                           #language en-US  "8"
#string STR_9                                           #language en-US  "9"
#string STR_10                                          #language en-US  "10"
#string STR_11                                          #language en-US  "11"
#string STR_12                                          #language en-US  "12"
#string STR_13                                          #language en-US  "13"
#string STR_14                                          #language en-US  "14"
#string STR_15                                          #language en-US  "15"
#string STR_16                                          #language en-US  "16"
#string STR_17                                          #language en-US  "17"
#string STR_18                                          #language en-US  "18"
#string STR_19                                          #language en-US  "18"
#string STR_20                                          #language en-US  "20"
#string STR_21                                          #language en-US  "21"
#string STR_22                                          #language en-US  "22"
#string STR_23                                          #language en-US  "23"
#string STR_24                                          #language en-US  "24"
#string STR_25                                          #language en-US  "25"
#string STR_28                                          #language en-US  "28"
#string STR_32                                          #language en-US  "32"
#string STR_40                                          #language en-US  "40"
#string STR_48                                          #language en-US  "48"
#string STR_56                                          #language en-US  "56"
#string STR_64                                          #language en-US  "64"
#string STR_80                                          #language en-US  "80"
#string STR_96                                          #language en-US  "96"
#string STR_112                                         #language en-US  "112"
#string STR_128                                         #language en-US  "128"
//[-end-160624-IB07400748-add]//
//[-start-160720-IB07400761-add]//
#string STR_VIDEO_CONFIG_STRING                         #language en-US "Video Configuration"
                                                        #language fr-FR "Configuration de Vidéo"
                                                        #language zh-TW "\wide顯示設定\narrow"
                                                        #language ja-JP "\wideディスプレイ設定\narrow"
                                                        #language it-IT "Configurazione video"
                                                        #language es-ES "Configuración video"
                                                        #language de-DE "Videokonfiguration"
                                                        #language pt-PT "Configuração de Vídeo"
#string STR_VIDEO_CONFIG_HELP                           #language en-US "Configures video settings."
                                                        #language fr-FR "Configurer le réglage de vidéo."
                                                        #language zh-TW "\wide調整顯示設定\narrow."
                                                        #language ja-JP "\wideディスプレイなどの表示装置に関する設定を行います。\narrow"
                                                        #language it-IT "Configurazione impostazioni video"
                                                        #language es-ES "Configure los ajustes videos."
                                                        #language de-DE "Konfigurieren Sie die Videoeinstellungen."
                                                        #language pt-PT "Ajustar Vídeo"
#string STR_LOGO_SCU_RESOLUTION_STRING                  #language en-US "Logo & SCU Resolution"
#string STR_LOGO_SCU_RESOLUTION_HELP                    #language en-US "Configuration Logo & Setup Utility Resolution"
#string STR_640X480                                     #language en-US "640 x 480"
#string STR_800X600                                     #language en-US "800 x 600"
#string STR_1024X768                                    #language en-US "1024 x 768"
#string STR_1280X1024                                   #language en-US "1280 x 1024"
#string STR_1366X768                                    #language en-US "1366 x 768"
#string STR_1680X1050                                   #language en-US "1680 x 1050"
#string STR_1920X1200                                   #language en-US "1920 x 1200"
#string STR_1280X800                                    #language en-US "1280 x 800"
#string STR_VBT_HOOK_CONFIGURATION                      #language en-US "VBT Hook Configuration"
#string STR_VBT_LFP1_DEV_TYPE                           #language en-US "LFP 1 Configuration"
#string STR_VBT_EFP1_DEV_TYPE                           #language en-US "EFP 1 Configuration"
#string STR_VBT_EFP2_DEV_TYPE                           #language en-US "EFP 2 Configuration"
#string STR_VBT_EFP3_DEV_TYPE                           #language en-US "EFP 3 Configuration"
#string STR_VBT_DEV_TYPE_HELP                           #language en-US "Select Device Type"
#string STR_VBT_OUTPUT_PORT                             #language en-US "  Output Port"
#string STR_VBT_OUTPUT_PORT_HELP                        #language en-US "Select Output Port"
#string STR_VBT_DDC_BUS_PIN                             #language en-US "  DDC Bus Pin"
#string STR_VBT_DDC_BUS_PIN_HELP                        #language en-US "Select DDC Bus Pin"
#string STR_VBT_AUX_CHANNEL                             #language en-US "  Aux Channel"
#string STR_VBT_AUX_CHANNEL_HELP                        #language en-US "Select Aux Channel"
#string STR_VBT_LFP_PANEL_NUMBER                        #language en-US "  Panel Number"
#string STR_VBT_LFP_PANEL_NUMBER_HELP                   #language en-US "Select LFP panel number (Panel Type define in VBT table)"
#string STR_VBT_EDID_SUPPORT                            #language en-US "  EDID Support"
#string STR_VBT_EDID_SUPPORT_HELP                       #language en-US "Enable/Disable EDID support"
#string STR_VBT_DEFAULT                                 #language en-US "VBT Default"
#string STR_VBT_NO_DEVICE                               #language en-US "No Device"
#string STR_VBT_EDP                                     #language en-US "eDP"
#string STR_VBT_MIPI                                    #language en-US "MIPI"
#string STR_VBT_DP                                      #language en-US "DisplayPort"
#string STR_VBT_HDMI_DVI                                #language en-US "HDMI/DVI"
#string STR_VBT_DVI_ONLY                                #language en-US "Integrated DVI only"
#string STR_VBT_DP_HDMI_DVI                             #language en-US "DisplayPort with HDMI/DVI Compatible"
#string STR_VBT_DP_DVI                                  #language en-US "DisplayPort with DVI Compatible"
#string STR_VBT_EDP_PORTA                               #language en-US "eDP Port A"
#string STR_VBT_MIPI_PORTA                              #language en-US "MIPI Port A"
#string STR_VBT_DP_PORTA                                #language en-US "DP Port A"
#string STR_VBT_DP_PORTB                                #language en-US "DP Port B"
#string STR_VBT_DP_PORTC                                #language en-US "DP Port C"
#string STR_VBT_HDMI_PORTB                              #language en-US "HDMI Port B"
#string STR_VBT_HDMI_PORTC                              #language en-US "HDMI Port C"
#string STR_VBT_NONE                                    #language en-US "N/A"
#string STR_1_TEXT                                      #language en-US "1"
#string STR_2_TEXT                                      #language en-US "2"
#string STR_3_TEXT                                      #language en-US "3"
#string STR_4_TEXT                                      #language en-US "4"
#string STR_5_TEXT                                      #language en-US "5"
#string STR_6_TEXT                                      #language en-US "6"
#string STR_7_TEXT                                      #language en-US "7"
#string STR_8_TEXT                                      #language en-US "8"
#string STR_9_TEXT                                      #language en-US "9"
#string STR_10_TEXT                                     #language en-US "10"
#string STR_11_TEXT                                     #language en-US "11"
#string STR_12_TEXT                                     #language en-US "12"
#string STR_13_TEXT                                     #language en-US "13"
#string STR_14_TEXT                                     #language en-US "14"
#string STR_15_TEXT                                     #language en-US "15"
#string STR_16_TEXT                                     #language en-US "16"
#string STR_LPC_CLOCK_RUN_ENABLE_PROMPT                 #language en-US "LPC Clock Run Pin"
#string STR_LPC_CLOCK_RUN_ENABLE_HELP                   #language en-US "Enable/Disable LPC Clock Run LPC_CLKRUN_N pin to disable LPC clock."
//[-end-160720-IB07400761-add]//
//[-start-160726-IB07400762-add]//
#string STR_SIC_VERSION_STRING                          #language en-US "SIC Version"
//[-end-160726-IB07400762-add]//
//[-start-160809-IB07400769-add]//
#string STR_TXE_PREPARE_FOR_UPDATE_PROMPT               #language en-US "TXE Prepare For Update"
#string STR_TXE_PREPARE_FOR_UPDATE_HELP                 #language en-US "Send Prepare For Update Command in next boot, please send this command before update IAFW BIOS or TXE data region. Note: NVMs data is unavaiable in next boot."
//[-end-160809-IB07400769-add]//
//[-start-160818-IB07400772-add]//
#string STR_VBT_HDMI_LEVEL_SHIFTER                      #language en-US "  HDMI Level Shifter"
#string STR_VBT_HDMI_LEVEL_SHIFTER_HELP                 #language en-US "Select HDMI Level Shifter."
#string STR_VBT_400MV_0P0_DB                            #language en-US "400 mV 0.0dB"
#string STR_VBT_400MV_3P5_DB                            #language en-US "400 mV 3.5dB"
#string STR_VBT_400MV_6P0_DB                            #language en-US "400 mV 6.0dB"
#string STR_VBT_400MV_9P5_DB                            #language en-US "400 mV 9.5dB"
#string STR_VBT_600MV_0P0_DB                            #language en-US "600 mV 0.0dB"
#string STR_VBT_600MV_3P5_DB                            #language en-US "600 mV 3.5dB"
#string STR_VBT_600MV_6P0_DB                            #language en-US "600 mV 6.0dB"
#string STR_VBT_800MV_0P0_DB                            #language en-US "800 mV 0.0dB"
#string STR_VBT_800MV_3P5_DB                            #language en-US "800 mV 3.5dB"
#string STR_VBT_1200MV_0P0_DB                           #language en-US "1200 mV 0.0dB"
#string STR_VBT_ONBOARD_LSPCON                          #language en-US "  Onboard LSPCON for HDMI 2.0"
#string STR_VBT_ONBOARD_LSPCON_HELP                     #language en-US "Enable/Disable Onboard LSPCON for HDMI 2.0"
#string STR_VBT_HPD_INVERSION                           #language en-US "  HPD Inversion"
#string STR_VBT_HPD_INVERSION_HELP                      #language en-US "Enable/Disable HPD Inversion"
#string STR_VBT_DDI_LANE_REVERSAL                       #language en-US "  DDI Lane Reversal"
#string STR_VBT_DDI_LANE_REVERSAL_HELP                  #language en-US "Enable/Disable DDI Lane Reversal"
#string STR_VBT_USB_TYPC_SUPPORT                        #language en-US "  USB TypeC Dongle"
#string STR_VBT_USB_TYPC_SUPPORT_HELP                   #language en-US "Enable/Disable USB TypeC Dongle feature"
#string STR_VBT_DOCKABLE_PORT                           #language en-US "  Dockable Port"
#string STR_VBT_DOCKABLE_PORT_HELP                      #language en-US "Enable/Disable Dockable Port feature"
//[-end-160818-IB07400772-add]//
//[-start-170105-IB07400830-add]//
#string STR_AESNI_PROMPT                                #language en-US "AES-NI"
#string STR_AESNI_PROMPT_HELP                           #language en-US "Enable/Disable AES-NI ."
//[-end-170105-IB07400830-add]//
//[-start-170124-IB07400837-add]//
#string STR_ROTATE_SCREEN_PROMPT                        #language en-US "Rotate Screen"
#string STR_ROTATE_SCREEN_HELP                          #language en-US "Enable/Disable Rotate Screen feature, support 90 and 270 degrees clockwise"
#string STR_ROTATE_SCREEN_090_DEG                       #language en-US " 90 degrees clockwise"
#string STR_ROTATE_SCREEN_270_DEG                       #language en-US "270 degrees clockwise"
//[-end-170124-IB07400837-add]//
//[-start-170222-IB07400843-add]//
#string STR_SERIAL_IRQ_STRING                           #language en-US        "Serial IRQ"
#string STR_SERIAL_IRQ_HELP                             #language en-US        "Enable/Disable Serial IRQ"
#string STR_SERIAL_IRQ_MODE_STRING                      #language en-US        "Serial IRQ Mode"
#string STR_SERIAL_IRQ_MODE_HELP                        #language en-US        "Select Serial IRQ Mode"
#string STR_SERIAL_IRQ_QUIET_MODE                       #language en-US        "Quiet Mode"
#string STR_SERIAL_IRQ_CONTINUOUS_MODE                  #language en-US        "Continuous Mode"
//[-end-170222-IB07400843-add]//
//[-start-170314-IB07400847-add]//
#string STR_WAKE_ON_RTC_FROM_S5_PROMPT                  #language en-US "Wake on RTC from S5"
#string STR_WAKE_ON_RTC_FROM_S5_HELP                    #language en-US "Wake on RTC from S5 state, By Day of Month, Fixed time of every day, By sleep time or By OS utility."
#string STR_WAKE_BY_SLEEP_TIME_TEXT                     #language en-US "By Sleep Time"
#string STR_WAKE_BY_OS_UTILITY_TEXT                     #language en-US "By OS Utility"
#string STR_WAKE_FROM_S5_TIME_PROMPT                    #language en-US "  Wake from S5 Time"
//[-start-180410-IB07400956-modify]//
#string STR_WAKE_FROM_S5_TIME_HELP                      #language en-US "Wake form S5 state after 5 ~ 255 seconds."
//[-end-180410-IB07400956-modify]//
#string STR_WAKE_S5_AFTER_SECONDS_PROMPT                #language en-US "  Wake from S5 after (seconds)"
//[-end-170314-IB07400847-add]//
//[-start-170613-IB07400874-add]//
#string STR_BIOS_BOOT_SOURCE_PROMPT                     #language en-US "BIOS Boot Source"
#string STR_BIOS_BOOT_SOURCE_HELP                       #language en-US ""
//[-end-170613-IB07400874-add]//

//
//  SEG Chipset Feature 
//
//[-start-160923-IB07400789-add]//
#string STR_SEG_CHIPSET_FEATURE_TITLE                   #language en-US "SEG Chipset Feature"
#string STR_WIN7_KB_MS_SUPPORT_TITLE                    #language en-US "Win7 Keyboard/Mouse Support"
#string STR_WIN7_KB_MS_SUPPORT_HELP                     #language en-US "Support USB Keyboard/Mouse under Win7 without XHCI driver"
//[-end-160923-IB07400789-add]//
//[-start-170626-IB07400880-add]//
#string STR_S5_WAKE_ON_USB_PROMPT                       #language en-US  "Wake on USB from S5"
#string STR_S5_WAKE_ON_USB_HELP                         #language en-US  "Enable/Disable Wake on USB from S5 state"
#string STR_S5_WAKE_ON_USB_WAIT_TIME_PROMPT             #language en-US  "  Wake on USB Wait Time (Sec)"
#string STR_S5_WAKE_ON_USB_WAIT_TIME_HELP               #language en-US  "Wait Time for USB re-enumeration during S5 state"
//[-end-170626-IB07400880-add]//
//[-start-170119-IB07401072-add]//
#string STR_PCI_MEM64_DECODE_STRING                     #language en-US "PCI 64-bit Decode"    
#string STR_PCI_MEM64_DECODE_HELP                       #language en-US "Allow system to support 64-bit BAR for PCI devices"
#string STR_PCI_MEM64_SKIP_ONBOARD_STRING               #language en-US "  Skip Onboard devices"    
#string STR_PCI_MEM64_SKIP_ONBOARD_HELP                 #language en-US "Skip assign 64-bit MMIO to Onboard Devices"
//[-end-170119-IB07401072-add]//
